catppuccin.catppuccin-vsc
christian-kohler.path-intellisense
cs128.cs128-clang-tidy
davidanson.vscode-markdownlint
donjayamanne.python-extension-pack
eamodio.gitlens
esbenp.prettier-vscode
github.copilot
github.copilot-chat
gruntfuggly.todo-tree
kevinrose.vsc-python-indent
marus25.cortex-debug
mcu-debug.debug-tracker-vscode
mcu-debug.memory-view
mcu-debug.peripheral-viewer
mcu-debug.rtos-views
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.remote-explorer
ms-vscode.vscode-serial-monitor
nordic-semiconductor.nrf-devicetree
paulober.pico-w-go
raspberry-pi.raspberry-pi-pico
tomoki1207.pdf
twxs.cmake
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
